create_clock -name clk -period 10.0 -waveform {0 5} [get_ports clk]
set_clock_uncertainty 0.2 [get_clocks clk]
set_input_delay 2.0 -clock clk [get_ports {wr_en rd_en}]
set_input_delay 2.0 -clock clk [get_ports din*]
set_output_delay 2.0 -clock clk [get_ports dout*]
set_output_delay 2.0 -clock clk [get_ports {empty full}]
set_drive 0 [get_ports clk]
set_drive 1 [get_ports {wr_en rd_en}]
set_drive 1 [get_ports din*]
set_load 0.1 [get_ports dout*]
set_load 0.05 [get_ports {empty full}]
set_false_path -from [get_ports rst_n]

